export class Constants {
  public static IngredientsList: Array<string> = [];

  public static CategoriesList: Array<string> = ['Салати', 'Предястия', 'Супи', 'Основни', 'Десерти', 'Напитки', 'Ядки'];

  public static readonly LanguagesList: Array<string> = [
    'English', 'Cebuano', 'Deutsch', 'français', 'svenska', 'Nederlands', 'русский', 'español', 'italiano',
    'مصرى', 'polski', '日本語', '中文', 'українська', 'Tiếng Việt', 'Winaray', 'العربية', 'português', 'فارسی', 'català',
    'српски/srpski', 'Bahasa Indonesia', '한국어', 'norsk', 'нохчийн', 'suomi', 'Türkçe', 'čeština', 'magyar',
    'татарча / tatarça', 'srpskohrvatski/српскохрватски', 'română', 'Bân-lâm-gú', 'euskara', 'Bahasa Melayu',
    'Esperanto', 'עברית', 'հայերեն', 'dansk', 'български', 'Cymraeg', 'oʻzbekcha/ўзбекча', 'slovenčina', 'Simple English',
    'تۆرکجه', 'eesti', 'беларуская', 'қазақша', 'Ελληνικά', 'Minangkabau', 'hrvatski', 'lietuvių', 'galego', 'اردو', 'azərbaycanca',
    'slovenščina', 'Ladin', 'ქართული', 'norsk nynorsk', 'தமிழ்', 'ไทย', 'हिन्दी', 'বাংলা', 'македонски', 'Latina', '粵語', 'asturianu',
    'latviešu', 'Afrikaans', 'тоҷикӣ', 'မြန်မာဘာသာ', 'Malagasy', 'shqip', 'मराठी', 'bosanski', 'తెలుగు', 'occitan', 'brezhoneg',
    'беларуская (тарашкевіца)', 'മലയാളം', 'Plattdüütsch', 'Kiswahili', 'кыргызча', 'kurdî', 'lombard', 'Jawa', 'پنجابی', 'नेपाल भाषा',
    'Kreyòl ayisyen', 'vèneto', 'Piemontèis', 'башҡортса', 'Lëtzebuergesch', 'Sunda', 'Gaeilge', 'íslenska', 'ślůnski', 'کوردی', 'Frysk',
    'чӑвашла', 'ਪੰਜਾਬੀ', 'Tagalog', 'aragonés', 'Ido', '吴语', 'Zazaki', 'Hausa', 'Volapük', 'Scots', 'Yorùbá', 'नेपाली', 'ಕನ್ನಡ', 'ગુજરાતી',
    'Alemannisch', 'interlingua', 'Kotava', 'qırımtatarca', 'Boarisch', 'sicilianu', 'বিষ্ণুপ্রিয়া মণিপুরী', 'Runa Simi', 'Igbo', 'монгол',
    'Diné bizaad', 'Basa Bali', 'მარგალური', 'සිංහල', 'مازِرونی', 'Nordfriisk', 'پښتو', 'chiTumbuka', 'ирон', 'ଓଡ଼ିଆ', 'žemaitėška',
    'саха тыла', '閩東語/Mìng-dĕ̤ng-ngṳ̄', 'Bikol Central', 'Gàidhlig', 'Basa Ugi', 'سنڌي', 'ייִדיש', 'Ilokano', 'አማርኛ', 'Limburgs',
    'Napulitano', 'Bahasa Hulontalo', 'मैथिली', 'føroyskt', 'hornjoserbsce', 'Basa Banyumasan', 'ၽႃႇသႃႇတႆး', 'emiliàn e rumagnòl', 'Acèh',
    '文言', 'অসমীয়া', 'Interlingue', 'संस्कृतम्', 'walon', 'Արեւմտահայերէն', 'chiShona', 'олык марий', 'Ligure', 'isiZulu', 'Fiji Hindi',
    'Banjar', 'кырык мары', 'ភាសាខ្មែរ', 'ᱥᱟᱱᱛᱟᱲᱤ', 'ꯃꯤꯇꯩ ꯂꯣꯟ', '客家語/Hak-kâ-ngî', 'الدارجة', 'tarandíne', 'Kapampangan', 'dagbanli',
    'русиньскый', 'भोजपुरी', 'Sesotho sa Leboa', 'corsu', 'Soomaaliga', 'West-Vlams', 'Māori', 'Nedersaksies', 'эрзянь', 'davvisámegiella',
    'sardu', 'བོད་ཡིག', 'kernowek', 'vepsän kel’', 'Ikinyarwanda', 'گیلکی', 'Türkmençe', 'Taqbaylit', '贛語', 'võro', 'Gaelg', 'Zeêuws', 'аԥсшәа',
    'Malti', 'سرائیکی', 'tolışi', 'ئۇيغۇرچە/Uyghurche', 'Nāhuatl', 'arpetan', 'удмурт', 'Picard', 'anarâškielâ', 'коми', 'kaszëbsczi',
    'Aymar aru', 'Nouormand', 'कॉशुर / کٲشُر', 'мокшень', 'лезги', 'livvinkarjala', 'Qaraqalpaqsha', 'Mirandés', 'Lingua Franca Nova', 'Ænglisc',
    'Seeltersk', 'ລາວ', 'furlan', 'rumantsch', 'Twi', 'lingála', 'Papiamentu', 'Ladino', 'estremeñu', 'गोंयची कोंकणी/Gõychi Konknni', 'тыва дыл',
    'перем коми', 'авар', 'डोटेली', 'dolnoserbski', 'Chavacano de Zamboanga', 'ދިވެހިބަސް', 'Ripoarisch', 'Vahcuengh', 'Luganda', 'Gagauz', 'буряад',
    'Pälzisch', 'Sakizaya', 'ပအိုဝ်ႏဘာႏသာႏ', 'Tayal', 'Pangasinan', 'पालि', 'Hawaiʻi', 'अवधी', 'гӀалгӀай', 'къарачай-малкъар', 'lea faka-Tonga',
    'Atikamekw', 'Deitsch', 'ತುಳು', 'ဘာသာမန်', 'ܐܪܡܝܐ', 'isiXhosa', 'Fulfulde', 'Taclḥit', 'хальмг', 'Patois', 'Kabɩyɛ', 'Wolof', 'Oromoo',
    'Gĩkũyũ', 'Li Niha', 'अंगिका', 'ⵜⴰⵎⴰⵣⵉⵖⵜ ⵜⴰⵏⴰⵡⴰⵢⵜ', 'адыгэбзэ', 'Novial', 'ߒߞߏ', 'Bislama', 'Tok Pisin', 'tetun', 'armãneashti',
    'la .lojban.', 'Setswana', 'Na Vosa Vakaviti', 'Kongo', 'лакку', 'gungbe', 'reo tahiti', 'словѣньскъ/ⰔⰎⰑⰂⰡⰐⰠⰔⰍⰟ', 'romani čhib',
    'Madhurâ', 'Seediq', 'Pangcah', 'Sranantongo', 'Dagaare', 'Gagana Samoa', 'алтай тил', 'latgaļu', 'Naijá', 'kriyòl gwiyannen', 'ᏣᎳᎩ',
    'Chi-Chewa', 'Tyap', 'Ghanaian Pidgin', 'Sesotho', 'Norfuk/Pitkern', '𐌲𐌿𐍄𐌹𐍃𐌺', 'farefare', 'SiSwati', 'eʋegbe', 'bamanankan', 'Xitsonga',
    'Tshivenda', 'Batak Toba', 'Tsetsêhestâhese', 'fɔ̀ngbè', 'ikirundi', 'Iñupiatun', 'адыгабзэ', 'Chamoru', 'mfantse', 'wayuunaiki', 'Ποντιακά',
    'ᐃᓄᒃᑎᑐᑦ/inuktitut', 'pinayuanan', 'Sängö', 'Thuɔŋjäŋ', 'ትግርኛ', 'kalaallisut', 'ཇོང་ཁ', 'Nēhiyawēwin/ᓀᐦᐃᔭᐍᐏᐣ'];

  public static readonly TimeOptions: Array<string> = [
    '00:00', '00:30', '01:00', '01:30', '02:00', '02:30',
    '03:00', '03:30', '04:00', '04:30', '05:00', '05:30',
    '06:00', '06:30', '07:00', '07:30', '08:00', '08:30',
    '09:00', '09:30', '10:00', '10:30', '11:00', '11:30',
    '12:00', '12:30', '13:00', '13:30', '14:00', '14:30',
    '15:00', '15:30', '16:00', '16:30', '17:00', '17:30',
    '18:00', '18:30', '19:00', '19:30', '20:00', '20:30',
    '21:00', '21:30', '22:00', '22:30', '23:00', '23:30'
  ];

  public static readonly DaysOfWeek: Array<any> = [
    {
      'bulgarian': 'Понеделник',
      'english': 'Monday'
    },
    {
      'bulgarian': 'Вторник',
      'english': 'Tuesday'
    },
    {
      'bulgarian': 'Сряда',
      'english': 'Wednesday'
    },
    {
      'bulgarian': 'Четвъртък',
      'english': 'Thursday'
    },
    {
      'bulgarian': 'Петък',
      'english': 'Friday'
    },
    {
      'bulgarian': 'Събота',
      'english': 'Saturday'
    },
    {
      'bulgarian': 'Неделя',
      'english': 'Sunday'
    }];

  public static AccommodationFacilitiesList: Array<any> = [
    {
      name: 'Популярни',
      facilities: ['Басейн', 'Ресторант', 'Румсървис', 'Бар', 'Денонощна рецепция', 'Сауна', 'Фитнес център', 'Градина', 'Тераса', 'Стая за непушачи', 'Летищен трансфер', 'Семейна стая', 'Спа и Уелнес център', 'Хидромасажна вана/джакузи', 'Климатик', 'Детски клуб', 'Аквапарк']
    },
    {
      name: 'Дейности',
      facilities: ['Съоръжения за тенис', 'Съоръжения за бадминтон', 'Плаж', 'Временни картинни галерии', 'Обиколка на барове', 'Стендъп комедия', 'Филмови нощи', 'Пешеходни обиколки', 'Велосипедни обиколки', 'Тематични вечери', 'Оферта Happy hour', 'Обиколка или час за местната култура', 'Час по готварство', 'Музика на живо/представление', 'Спортни събития на живо (излъчване)', 'Стрелба с лък', 'Аеробика', 'Бинго', 'Тенис корт', 'Билярд', 'Тенис на маса', 'Дартс', 'Скуош', 'Боулинг', 'Миниголф', 'Голф игрище (до 3 км)', 'Съоръжения за воден спорт на място', 'Уиндсърф', 'Гмуркане', 'Гмуркане с шнорхел', 'Кану-каяк', 'Риболов', 'Конна езда', 'Колоездене', 'Пешеходен туризъм', 'Ски услуги']
    },
    {
      name: 'Храни и напитки',
      facilities: ['Детско меню', 'Шведска маса, подходяща за деца', 'Вино/шампанско', 'Плодове', 'Кафене на място', 'Снекбар', 'Доставка на покупки', 'Пакетиран обяд', 'Барбекю', 'Вендинг машина (напитки)', 'Вендинг машина (снаксове)', 'Специални диетични менюта (по заявка)', 'Закуска в стаята']
    },
    {
      name: 'Басейн и уелнес',
      facilities: ['Водна пързалка', 'Шезлонги', 'Плажни чадъри', 'Разкрасителни процедури', 'Спа удобства', 'Парна баня', 'Спа зона/зона за релакс', 'Вана за крака', 'Спа/уелнес пакети', 'Масажен стол', 'Фитнес', 'Йога', 'Фитнес тренировки', 'Личен треньор', 'Фитнес/спа съблекалня', 'Детски басейн', 'Турска баня/Хамам', 'Солариум', 'Горещ минерален извор', 'Масаж', 'Традиционна обществена баня на открито', 'Обществена баня']
    },
    {
      name: 'Транспорт',
      facilities: ['Билети за градския транспорт', 'Превоз', 'Паркинг за велосипеди', 'Наем на велосипеди', 'Коли под наем', 'Паркинг']
    },
    {
      name: 'Рецепция',
      facilities: ['Фактура при заявка', 'Персонално настаняване/напускане', 'Експресно настаняване/напускане', 'Консиерж услуги', 'Туристическо бюро', 'Обменно бюро', 'Банкомат в хотела', 'Помещение за съхранение на багаж', 'Шкафчета']
    },
    {
      name: 'Общи части',
      facilities: ['Градинска мебел', 'Зона за пикник', 'Вътрешна камина', 'Външна камина', 'Тераса за слънчеви бани', 'Обща кухня', 'Обща TV зала', 'Зала за игри', 'Църква/Храм']
    },
    {
      name: 'Развлечения и услуги за семейства',
      facilities: ['Настолни игри/пъзели', 'Закрит кът за игра', 'Детска площадка', 'Предпазни прегради за деца', 'Детски колички', 'Вечерни забавления', 'Нощен клуб/Диджей', 'Казино', 'Караоке', 'Аниматори', 'Гледане на деца']
    },
    {
      name: 'Почистване',
      facilities: ['Химическо чистене', 'Гладене', 'Пералня', 'Ежедневно почистване', 'Преса за панталони']
    },
    {
      name: 'Бизнес удобства',
      facilities: ['Конферентна/Банкетна зала', 'Бизнес център', 'Факс/Копирни услуги']
    },
    {
      name: 'Магазини',
      facilities: ['Минимаркет на място', 'Фризьорски/Козметичен салон']
    },
    {
      name: 'Разни',
      facilities: ['Легло за домашни любимци', 'Купички за домашни любимци', 'Достъп с ключ', 'Достъп с карта', 'Антиалергични стаи', 'Само за непушачи', 'Зона за пушачи', 'Стаи/Услуги за хора с двигателни увреждания', 'Асансьор', 'Шумоизолирани стаи', 'Отопление']
    },
    {
      name: 'Безопасност и сигурност',
      facilities: ['Денонощна сигурност', 'Аларма за сигурност', 'Аларма за дим', 'Камери за видеонаблюдение в общите части', 'Камери за видеонаблюдение извън мястото за настаняване', 'Пожарогасители', 'Детектор за въглероден окис', 'Източници на въглероден оксид', 'Сейф']
    },
  ]

  public static BathroomAmenitiesList: Array<string> = [
    'Тоалетна хартия', 'Биде', 'Вана или душ', 'Халат за баня', 'Безплатни тоалетни принадлежности', 'Допълнителна тоалетна',
    'Сешоар', 'Споделена тоалетна', 'Сауна', 'Душ', 'Чехли', 'Тоалетна', 'Допълнителна баня', 'Четка за зъби', 'Шампоан',
    'Балсам за коса', 'Душ гел', 'Шапка за душ'
  ];



  public static RoomTypesList: Array<string> = [
    'Единична', 'Двойна стая със спалня', 'Двойна стая с две единични легла',
    'Тройна', 'Четворна', 'Суит', 'Семейна', 'Студио', 'Апартамент'
  ];

  public static BedTypesList: Array<string> = [
    'Единично легло (90 - 130 cm широко)', 'Двойно легло (131 - 150 cm широко)', 'Голямо (кралски размер, 151-180 cm широко)',
    'Екстра голямо (Super-king size, 181 - 210 cm широко)', 'Двуетажно легло (Различни размери)',
    'Разтегателен диван (Различни размери)', 'Разтегателен фотьойл (Различни размери)'
  ];

  public static RoomAmenitiesList: Array<any> = [
    {
      name: 'Популярни',
      amenities: ['Климатик', 'Балкон', 'Вана', 'Гледка', 'Телевизор с плосък екран', 'Частен басейн', 'Тераса', 'Електрическа кана', 'Спа вана']
    },
    {
      name: 'Удобства в стаите',
      amenities: ['Бебешки креватчета', 'Рафт за дрехи', 'Сушилник за дрехи', 'Походно легло', 'Разтегателен диван/фотьойл', 'Кошчета за отпадъци', 'Отопляем басейн', 'Панорамен (инфинити) басейн', 'Малък басейн', 'Покривало за басейн', 'Плажни кърпи', 'Басейн с гледка', 'Басейн на покрива', 'Солен басейн', 'Басейн с плитка част', 'Сушилня', 'Гардероб или килер', 'Мокет', 'Дрешник', 'Удължени легла (над 2 м)', 'Вентилатор', 'Камина', 'Отопление', 'Налични свързани стаи', 'Ютия', 'Удобства за гладене', 'Хидромасажна вана', 'Мрежа против комари', 'Частен вход', 'Сейф', 'Диван', 'Шумоизолация', 'Кът за сядане', 'Теракотен/мраморен под', 'Преса за панталони', 'Пералня', 'Дървен под/паркет', 'Бюро', 'Хипоалергенни продукти', 'Почистващи продукти', 'Електрически одеяла', 'Пижама', 'Юката', 'Контакт до леглото', 'Адаптер', 'Пухена възглавница', 'Непухена възглавница', 'Хипоалергенна възглавница']
    },
    {
      name: 'Медия и технологии',
      amenities: ['Кабелни канали', 'Сателитни канали', 'Телефон', 'Телевизор', 'Видео игри', 'Стрийминг услуга (напр. Netflix)']
    },
    {
      name: 'Храни и напитки',
      amenities: ['Кът за хранене', 'Маса за хранене', 'Чаши за вино', 'Бутилка вода', 'Шоколад/сладки', 'Плодове', 'Вино/шампанско', 'Барбекю', 'Фурна', 'Котлон', 'Тостер', 'Миялна машина', 'Кът за хранене на открито', 'Външни мебели', 'Минибар', 'Кухня', 'Кухненски бокс', 'Кухненски прибори и съдове', 'Микровълнова фурна', 'Хладилник', 'Машина за чай/кафе', 'Кафе машина', 'Висок стол за деца']
    },
    {
      name: 'Услуги и екстри',
      amenities: ['Достъп с карта', 'Заключващи се шкафчета', 'Достъп с ключове', 'Достъп до ВИП салон', 'Будилник', 'Събуждане по телефона', 'Събуждане по телефона/будилник', 'Спално бельо', 'Хавлиени кърпи', 'Кърпи/спално бельо (срещу доплащане)']
    },
    {
      name: 'Открити пространства и изглед',
      amenities: ['Веранда', 'Гледка към града', 'Гледка към градината', 'Гледка към езерото', 'Гледка към забележителност', 'Гледка към планината', 'Гледка към басейна', 'Гледка към реката', 'Гледка към морето', 'Гледка към вътрешен двор', 'Гледка към тиха улица']
    },
    {
      name: 'Достъпност',
      amenities: ['Достъп с асансьор', 'Разположение изцяло на приземния етаж', 'Достъп за хора в инвалидни колички', 'Достъп за хора с увреден слух', 'По-високите етажи са достъпни с асансьор', 'По-високите етажи са достъпни само по стълбите', 'Вана с помощни дръжки', 'Шнур за спешни случаи в банята', 'Тоалетна с висока седалка', 'Ниска мивка', 'Душ, достъпен за хора с увреждания', 'Седалка за баня', 'Тоалетна с помощни дръжки', 'Отворен душ']
    },
    {
      name: 'Развлечения и услуги за семейства',
      amenities: ['Предпазни прегради за деца', 'Настолни игри/пъзели', 'Книги, DVD филми или музика за деца', 'Предпазители за контакти']
    },
    {
      name: 'Безопасност и сигурност',
      amenities: ['Детектор за въглероден окис', 'Източници на въглероден оксид', 'Противопожарна аларма', 'Пожарогасител']
    },
    {
      name: 'Мерки за безопасност',
      amenities: ['Инсталирани пречистватели на въздух']
    },
    {
      name: 'Почистване и дезинфекция',
      amenities: ['Дезинфектант за ръце']
    }
  ];

  public static FilterAmenities: Array<string> = [
    'Басейн', 'Ресторант', 'Румсервиз', 'Денонощна рецепция',
    'Сауна', 'Фитнес център', 'Летищен трансфер', 'СПА и Уелнес център',
    'Климатик', 'Детски клуб', 'Аквапарк', 'Приспособен за хора с увреждания'
  ];

}
