namespace Gostopolis.Restaurants.Data.Configurations;

using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using Models;

/// <inheritdoc />
public class RestaurantTypeConfiguration : IEntityTypeConfiguration<RestaurantType>
{
    /// <inheritdoc />
    public void Configure(EntityTypeBuilder<RestaurantType> builder)
    {
        builder
            .HasKey(r => r.Id);

        builder
            .HasData(
                new RestaurantType(1, "Класически ресторант", "Предлага широк и разнообразен асортимент от висококачествена кухненска продукция, сладкарска продукция, десерти, плодове, специалитети, ястия, тестени изделия, безалкохолни и алкохолни напитки и създава условия за хранене и развлечения."),
                new RestaurantType(2, "Специализиран ресторант", "Асортиментът се базира на даден основен продукт. Обслужва туристи с определени интереси."),
                new RestaurantType(3, "Ресторант с национална кухня ", "Асортиментът се базира на съответните национални кухни и напитки."),
                new RestaurantType(4, "Атракционно-тематичен ресторант ", "С характерен архитектурен вътрешен и външен облик, с подходящ асортимент от ястия, напитки и/или артистично-музикална програма (шатри, кошари, колиби, фрегати, пикник и др.)."),
                new RestaurantType(5, "Снек-бар", "Предлага асортимент от ястия и специалитети, приготвени на скара или плоча, аламинути, салати, супи, бульони; готови сладкарски изделия, сладолед; топли напитки, алкохолни и безалкохолни напитки, бира (пиво). Кухненската продукция се приготвя пред клиента и се предлага от бар-плот."),
                new RestaurantType(6, "Бистро", "Кухненската продукция в заведението е ограничена до: студени и топли предястия, скара и аламинути, салати, супи, десерти. Липсва предварителният процес на подготовка на храната, т.е. използват се предварително подготвени храни – полуфабрикати. Карт-менюто включва топли напитки, безалкохолни и алкохолни напитки и бира."),
                new RestaurantType(7, "Фаст-фууд", "Предлага сандвичи, различни видове бургери, пържени картофи, скара от месни полуфабрикати, сосове, салати, готови тестени изделия, сладкарски изделия, захарни и шоколадови изделия, сладолед, топли напитки, безалкохолни напитки и бира."),
                new RestaurantType(8, "Пицария", "Предлага различни видове пици, спагети, лазаня, макарони, салати, десерти и др., както и алкохолни и безалкохолни напитки."),
                new RestaurantType(9, "Кафе-аперитив", "Предлага богат асортимент от алкохолни и безалкохолни напитки; ограничен асортимент кулинарна продукция – салати, студени мезета, пържени картофи, месни полуфабрикати на скара, сандвичи, бургери, захарни и шоколадови изделия, ядки, сладолед."),
                new RestaurantType(10, "Винарна", "Предлага преобладаващо богат асортимент от наливни и бутилирани вина, други алкохолни и безалкохолни напитки, подходяща кухненска продукция и мезета. Може да има условия за дегустация."),
                new RestaurantType(11, "Пивница (кръчма)", "Предлага разливни и бутилирани алкохолни и безалкохолни напитки, топли напитки, салати, студени мезета, ядки, захарни и шоколадови изделия."),
                new RestaurantType(12, "Бирария", "Предлага разнообразен асортимент от наливна и бутилирана бира, салати, студени мезета, пържени картофи, месни полуфабрикати на скара, топли напитки, безалкохолни и алкохолни напитки."),
                new RestaurantType(13, "Сладкарница", "Предлага малотрайни и трайни сладкарски изделия, захарни и шоколадови изделия, тестени закуски, сандвичи, сладолед, топли напитки и безалкохолни напитки."),
                new RestaurantType(14, "Кафе-клуб", "Заведение за клиенти с определени интереси (интернет, изкуство, игри и др.), в което се предлагат топли напитки, безалкохолни напитки, алкохолни напитки, захарни и шоколадови изделия, ядки."),
                new RestaurantType(15, "Кафетерия", "Предлага разнообразни топли напитки, безалкохолни напитки, закуски, тестени, захарни и шоколадови изделия."),
                new RestaurantType(16, "Коктейл-бар", "Предлага богат асортимент предимно от алкохолни и безалкохолни коктейли и напитки, ядки, сладкарска продукция и захарни изделия."),
                new RestaurantType(17, "Кафе-бар", "Предлага различни видове кафе, безалкохолни и алкохолни напитки, плодове и др."),
                new RestaurantType(18, "Бар-фоайе (Lobby bar)", "Предлага алкохолни и безалкохолни напитки, коктейли, закуски, десерти, ядки и др. Разположен е в непосредствена близост до фоайето на средства за подслон или места за настаняване."),
                new RestaurantType(19, "Дискотека", "Заведение предимно за танцуване с дансинг и плотове в търговската зала и ограничен брой места за сядане. Предлага алкохолни и безалкохолни напитки, коктейли, ядки, топли напитки, сандвичи, захарни и шоколадови изделия."),
                new RestaurantType(20, "Бар-клуб", "Заведение с музикално-артистична програма за клиенти с определени интереси, предлагащо алкохолни и безалкохолни напитки, кухненска и сладкарска продукция и др."),
                new RestaurantType(21, "Пиано-бар", "Заведение с тихо музициране и асортимент, съответстващ на асортимента на баровете."),
                new RestaurantType(22, "Нощен бар", "Предлага асортимент за барове и е с нощен режим на работа."));
    }
}
